window.hint = [
    // room1 : 기억의 틈
    // room2 : 위험한 초대
    // room3 : 준비중입니다.
    // room4 : 준비중입니다.
    // 하단 대괄호('{') 안에 힌트를 하나씩 적을 수 있습니다.
    // theme에는 위에 적어 둔 테마 별로 이름을 정해주어야합니다.
    // hintNumber는 해당 힌트가 몇 번째 힌트인지 알려주기 때문에 테마별로 번호가 시작합니다. 번호를 늘려가면서 적어주세요.
    // hintContent는 힌트 내용을 줄글로 적어줍니다. 손님들이 보게되는 힌트 내용입니다. 해당 내용을 줄글로 적어주세요.

    // 밑에 있는 것은 예시입니다.
    // theme : 'room1' 이면 501동 사람들에 해당하는 힌트입니다.
    // hintNumber : '1' 는 해당 힌트가 501동 사람들 테마에서 1번째 힌트입니다.
    // hintContent : '내용' 내용안에 힌트를 적어줍니다.
    // 모든 입력 값은 '' <- 작은 따옴표 안에 적어줍니다.
    // 큰 따옴표나 다른 괄호 종류를 사용할 때에는 모두 [] 대괄호를 사용해주세요 ex) [1234] 알맞은 표현 / "1234"이나 {1234} 틀린 표현
    // 새로운 힌트를 추가하기 위해서는 {} <- 대괄호를 모두 복사해서 하단에 추가합니다.
    // 이 경우 중괄호 {}, 마지막에 반점이 들어가야합니다. 주의해주세요!
    // 밑에 적혀있는 내용들은 예시로 적은 것이니 힌트 내용을 수정해주세요!

    ///////// 501동 사람들 /////////
    {
        theme: 'room1',
        hintNumber: '1',
        hintContent: 'X-KIT를 가족사진 액자에 태깅한 후 아버지와의 약속 자물쇠를 풀어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '2',
        hintContent: '가정통신문에 X-KIT 태깅후 가정통신문에 학년, ㅇ~ㅈ에서 반, 줄자로 벽에 그림에서 통신문에 맞는키를 잰후  X-KIT에 입력해주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '3',
        hintContent: '거울로 가정통신문 서랍위쪽을 살펴보세요.'
    },
    {
        theme: 'room1',
        hintNumber: '4',
        hintContent: '젓가락으로 미닫이문을 열어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '5',
        hintContent: '신발장 위에 있는 비디오 구매 영수증을 봐주신 후, 비디오 책장을 보고 방향 자물쇠를 풀어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '6',
        hintContent: '[죠스바=9바]에서 9는 죠스의 글자 획수를 구한 값입니다. 나머지 [빠삐]와 [월드]의 획수도 함께 세주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '7',
        hintContent: '지로통지서에서 [요한서금지을국관]을 찾아주시고 보일러에 노란색 스티커에 전화번호가 붙여져있습니다. 전화번호 바로 위쪽에 글자들로 [요한서금지을국관]에 맞는 숫자를 찾으신후 보일러 자물쇠를 풀어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '8',
        hintContent: 'X-KIT 태깅후 열로 아이들 사진을 태워보시고 14~16시 사이에 아이들을 찾아주신 다음에 바깥 비디오구매 영수증 밑서랍 자물쇠를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '9',
        hintContent: '다락방 낙서되어있는 창문 위쪽에 눈을 가까이 대고 자세히 보시면 영어모양을 보실수 있습니다 그리고 1층에 우리집 서랍을 풀어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '10',
        hintContent: '동자승 액자에 태깅후  X-KIT에 HATEI를 쳐주세요..'
    },
    {
        theme: 'room1',
        hintNumber: '11',
        hintContent: '다락방으로 이동후 노빨/검회/흰빨/검빨 순서대로 부적을 세신후 창문 자물쇠에 입력해주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '12',
        hintContent: '양말안에 열쇠로 신발장을 열어주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '13',
        hintContent: '신발장에 X-KIT태깅후 유치원 이름으로 꽃별천지 게임을 해주시면 됩니다. 꽃별천지로 유치원이름 획수를 일일이 세신후 꽃으로 끝나시면 꽃에 별로 끝나시면 별 천으로 끝나시면 천국 지로 끝나시면 지옥에 신발 놔주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '14',
        hintContent: '철문옆에 우편함에 있는 비디오를 티비 아래에 위치한 비디오 플레이어에 꽂아주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '15',
        hintContent: '비디오 시청후 비디오 자막에 있는 단서로 슈퍼마켓 오른쪽 골목에 들어가시면 있는 배전함에 답을 입력해주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '16',
        hintContent: '배전함 스위치를 올리신 후 X-KIT를 태깅해주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '17',
        hintContent: 'X-KIT 에 보이는 땅따먹기 규칙과 철문옆에 보이시는 규칙과 조합해 슈퍼마켓 문옆에 있는 낙서 4줄 순서대로 게임을 해주시면 됩니다. [0=왼발]로 홀수만 밟으시는거고 [△=오른발]로 짝수만 밟으시는거고 [ㅎㅌ=양발]을 다쓰시는겁니다 이 규칙들로 땅따먹기 게임진행 하시면서 밟지 않은 숫자들로 슈퍼문 자물쇠를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '18',
        hintContent: '슈퍼안 나무서랍 첫번째칸에 들어있는 장부로 금고를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '19',
        hintContent: '금고안에서 나온 핸드폰에 X-KIT 태깅후 녹음된 내용을 들으신 후, X-KIT 에 나와있는 통화 마침시간에 5분을 더해주고 냉장고안에 있는 함 자물쇠를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '20',
        hintContent: '할머니 시체위에 나와있는 한자들로 냉장고함 안에서 꺼내신 검은색함 비밀번호를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '21',
        hintContent: '검은색 함 안에있는 랜선 코드번호로 나무서랍 3번째칸 자물쇠를 풀어주시면 됩니다.'
    },
    {
        theme: 'room1',
        hintNumber: '22',
        hintContent: '2층과 1층에 랜선연결후 UP 버튼과 멜로디 버튼을 동시에 눌러주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '23',
        hintContent: '전화기를 들어 통화내용을 들으신 후 슈퍼마켓 벽면에 달력을 보시고 년도와날짜를 전화기 밑 키패드 자물쇠에 입력해주세요.'
    },
    {
        theme: 'room1',
        hintNumber: '24',
        hintContent: '액자와 UV랜턴을 꺼내신후 액자에 X-KIT를 태깅해주세요. 액자뒷면을 보시면 나비, 다섯손가락, 물고기 그림이 있습니다. 실종된 아이들 포스터를 UV 랜턴으로 보시면 한글자씩 나오는데 그 글자를 액자뒷면에 나온 순서대로 조합해주신 후 본명을 찾아주시고 빨간색 버튼에 모스부호를 입력해주시면 됩니다. 점은 1초정도 길게 눌러주시고 선은 2초정도 길게 눌러주시면 됩니다.'
    },


    ///////// 위험한 초대 /////////
    {
        theme: 'room2',
        hintNumber: '1',
        hintContent: '케이크위 초대장을 읽어보시면 영어 알파벳 [ HOXTr ] 이 보이실겁니다. 해당 알파벳들로 오른쪽 알파벳을 한글로 바꾼 표가 있습니다. 해당 표를 확인 후 키패드함에 답을 입력해주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '2',
        hintContent: '기사 말과 신부 말밑에 보시면 숫자가 적혀져 있습니다. 케이크밑에 미니체스판이 있는데 그 미니체스판을 보신후 오른쪽 체스판에 각각말밑에 있는 숫자대로 놔주시면 됩니다. 기사는 8A 기준에서 시작하시면 되고 신부는 H1 기준에서 시작해주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '3',
        hintContent: '나무서랍안 토글스위치가 두줄이 있으십니다. 눈동자 액자를 보신다음 안쪽 3칸은 눈동자가 바라보고있는 방향그대로 토글스위치를 조정해주시면 되고 바깥쪽 3칸은 눈동자가 바라보고 있는 반대방향으로 해주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '4',
        hintContent: '이동한의자 뒤 벽면에 REM기억D! 0해라3 이렇게 적혀져있으신데 이동하신분 책상위에 OMR카드를 보시면 REMIND! 0523 이라고 적혀져있습니다. 협동하셔서 없는부분을 대조해서 찾으신후 알파벳 자물쇠를 풀어주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '5',
        hintContent: '필통안에 있는 UV랜턴으로 책상을 보면 음표들을 찾으실 수 있습니다 각음표들 옆에는 [#숫자]가 적혀져있으십니다. 교가를 보시면 총 여섯 줄이 있는데 만약 #4 옆에 음표가 있으시면 교가의 4번째줄에서 해당 음표를 찾아주시면 됩니다. 그렇게 나머지 음표들도 교가에서 숫자를 먼저 찾아주신 후 칠판에 빨간색으로 칠해져 있는 음표 순서대로 다시 배열하신 후 가방 비밀번호를 열어주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '6',
        hintContent: '가방 안에 부탄가스를 책상 위에 부탄가스 놓는 곳에 놓아주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '7',
        hintContent: '부탄가스를 놓으신후 나오는 뉴스를 보시고 마지막 장면에 나오는 벌점을 보시고 교가옆에 붙어져있는 벌점표와 대조후 책상자물쇠를 여시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '8',
        hintContent: '의자 이동후 나오시는 음성을 들으시고 나오시는 체스말로 체스표를 맞는 위치에 놓아주시면 토글 스위치가 있는 나무서랍이 열리십니다. 해당 토글 스위치를 올리면 케익에서 칼을 얻을 수 있습니다. 그리고 나무상자 자물쇠를 열고 칼로 손등을 찌르면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '9',
        hintContent: '양초 그림이 그려진 스위치를 켜주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '10',
        hintContent: '손가락이 그려져있는 문제를 보신 후 없는 마디들을 모두 더하신 다음 소녀상옆에 있는 자물쇠에 답을 입력하고 나오는 액자를 걸어주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '11',
        hintContent: '나가신 후 거울에 글자가 써져있습니다. 글자들을 보시고 벽들에 붙혀져있는 그림들을 보신후 알파벳 자물쇠에 입력해주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '12',
        hintContent: '스키트를 액자에 태깅을 해주신 다음 음성을 들으시고 K 마크에 또 태깅을 해주세요 그리고 엑스키트에 배전함에 있는 코드를 입력해주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '13',
        hintContent: '핸드폰에 나온 수식을 푼 다음, △와 □에 맞는 숫자 카드를 숫자 함에 넣으면 뒤에 거울문이 열립니다.'
    },

    {
        theme: 'room2',
        hintNumber: '14',
        hintContent: '계단 위에 있는 열쇠로 문을 열어주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '15',
        hintContent: '화장대 오른쪽 서랍에 X-KIT를 태깅하시고 음성을 들은 후 전화기 책상 밑에 있는 통신선 연결 코드를 X-KIT에 입력해주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '16',
        hintContent: '검정색 나무 사물함 두번째 서랍에 나은혜 앞자리 주민번호 6자리를 입력해주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '17',
        hintContent: '교사수첩과 화장대위에 있는 청접장을 화장대 첫번째 서랍 왼쪽에 교사수첩을 넣어주고 오른쪽 칸에 청접장을 넣고 닫으면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '18',
        hintContent: '바구니안에 있는 출산예정일을 보신후 벽에 걸려져있는 태아사진을 보시면 숫자가 또 적혀져있습니다. 예를 들어 9라고 적혀져있는 태아사진에 3.1이라고 적혀져 있는데 그뜻은 9라고 적혀져있는 원고지에 3번째 줄 첫 번째 칸을 의미하는 것입니다. [공백포함] 나머지 1 0 8 2 7 도 찾아주면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '19',
        hintContent: '아기를 나무상자에 넣고 닫아주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '20',
        hintContent: '제사상 위에 있는 글을 읽어보신 후 각각 맞는 신들을 찾고 1층에 있는 방향 자물쇠를 풀어주면 됩니다.'
    },


    {
        theme: 'room2',
        hintNumber: '21',
        hintContent: '프로파일러 액자와 허소리 액자에 설명을 읽어보고 디케의 여신 액자에 칼이나 저울 파란색 선 밑에 대주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '22',
        hintContent: '문 안쪽으로 들어가시면 함이 있는데 스위치에 디케의눈을 가리고 나를 눌러라고 되어있습니다. 바깥 디케의 여신의 눈을 가리시고 스위치를 눌러주시면 됩니다.'
    },

    {
        theme: 'room2',
        hintNumber: '23',
        hintContent: 'X-KIT 태깅 후 벽에 붙어져있는 그림과 발전기 옆에 붙어져있는 그림을 대조 후 숫자를 구해주고 핸드폰에 입력해주세요.'
    },

    {
        theme: 'room2',
        hintNumber: '24',
        hintContent: 'X-KIT에 나오는 그림들로 발전기를 보시고 각각 숫자의 버튼이 올라갔는지 내려갔는지 맞춰주면 됩니다. '
    },
];
